## Day agenda
- pandas Introduction
- Creating Series data
- creating Data Frames
- Acessing data from series/DataFrame
- Reading Data From environment
- Explore data
- convert data from json to csv  etc..

## Pandas Introduction
- Developed in 2008 by mckiney
- Used for analyzing.cleaning ,exploring,and manipulating data
## Pandas can do
- finding the correlation
- handling with missing values
- avg,max,min
- plotting

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: numpy>=1.15.4 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas

In [3]:
pandas.__version__

'1.1.3'

In [4]:
import pandas as pd

## Series
- list
- tuple
- numpy array

In [5]:
s1=pd.Series([1,2,3,"apssdc"])
print(s1)
print(type(s1))

0         1
1         2
2         3
3    apssdc
dtype: object
<class 'pandas.core.series.Series'>

In [8]:
s1=pd.Series([1,2,3,"apssdc"],index=['x1','x2','x3','x4'])
print(s1)
print(type(s1))

x1         1
x2         2
x3         3
x4    apssdc
dtype: object
<class 'pandas.core.series.Series'>

In [11]:
## Series object with tuple format
s2=pd.Series((1,2,3,4))
print(s2)
s2.index=[11,12,13,14]
s2

0    1
1    2
2    3
3    4
dtype: int64

11    1
12    2
13    3
14    4
dtype: int64

In [20]:
## Series object with numpy array
import numpy as np
s3=pd.Series(np.arange(1,10))
print(s3)
print(type(s3))

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int32
<class 'pandas.core.series.Series'>

In [15]:
s1.index

Index(['x1', 'x2', 'x3', 'x4'], dtype='object')

In [16]:
s2.index

Int64Index([11, 12, 13, 14], dtype='int64')

In [17]:
s3.index

RangeIndex(start=0, stop=9, step=1)

In [18]:
s1

x1         1
x2         2
x3         3
x4    apssdc
dtype: object

In [19]:
s1['x2']

2

In [21]:
s1['x1'],s1['x3']

(1, 3)

In [31]:
s3.min()

1

In [32]:
s3.cumsum()

0     1
1     3
2     6
3    10
4    15
5    21
6    28
7    36
8    45
dtype: int32

## pandas date_range
- To work with data and time formates we can use date_range
- pandas.date_range()

In [34]:
import pandas as p
d1=p.date_range('01-01-2021',periods=10)
d1

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10'],
              dtype='datetime64[ns]', freq='D')

In [39]:
import pandas as p
d2=p.date_range('01-01-2021',periods=20,freq='1h')
d2

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 01:00:00',
               '2021-01-01 02:00:00', '2021-01-01 03:00:00',
               '2021-01-01 04:00:00', '2021-01-01 05:00:00',
               '2021-01-01 06:00:00', '2021-01-01 07:00:00',
               '2021-01-01 08:00:00', '2021-01-01 09:00:00',
               '2021-01-01 10:00:00', '2021-01-01 11:00:00',
               '2021-01-01 12:00:00', '2021-01-01 13:00:00',
               '2021-01-01 14:00:00', '2021-01-01 15:00:00',
               '2021-01-01 16:00:00', '2021-01-01 17:00:00',
               '2021-01-01 18:00:00', '2021-01-01 19:00:00'],
              dtype='datetime64[ns]', freq='H')

In [40]:
import pandas as p
d2=p.date_range('01-01-2021',periods=20,freq='24h')
d2

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06', '2021-01-07', '2021-01-08',
               '2021-01-09', '2021-01-10', '2021-01-11', '2021-01-12',
               '2021-01-13', '2021-01-14', '2021-01-15', '2021-01-16',
               '2021-01-17', '2021-01-18', '2021-01-19', '2021-01-20'],
              dtype='datetime64[ns]', freq='24H')

In [41]:
import pandas as p
d2=p.date_range(start='01-01-2021',end='01-02-2021',freq='5s')
d2

DatetimeIndex(['2021-01-01 00:00:00', '2021-01-01 00:00:05',
               '2021-01-01 00:00:10', '2021-01-01 00:00:15',
               '2021-01-01 00:00:20', '2021-01-01 00:00:25',
               '2021-01-01 00:00:30', '2021-01-01 00:00:35',
               '2021-01-01 00:00:40', '2021-01-01 00:00:45',
               ...
               '2021-01-01 23:59:15', '2021-01-01 23:59:20',
               '2021-01-01 23:59:25', '2021-01-01 23:59:30',
               '2021-01-01 23:59:35', '2021-01-01 23:59:40',
               '2021-01-01 23:59:45', '2021-01-01 23:59:50',
               '2021-01-01 23:59:55', '2021-01-02 00:00:00'],
              dtype='datetime64[ns]', length=17281, freq='5S')

In [44]:
import pandas as pd
date=pd.Series(pd.date_range(start='01-01-2021',end='01-02-2021',freq='5s'))
print(date)
print(type(date))

0       2021-01-01 00:00:00
1       2021-01-01 00:00:05
2       2021-01-01 00:00:10
3       2021-01-01 00:00:15
4       2021-01-01 00:00:20
                ...
17276   2021-01-01 23:59:40
17277   2021-01-01 23:59:45
17278   2021-01-01 23:59:50
17279   2021-01-01 23:59:55
17280   2021-01-02 00:00:00
Length: 17281, dtype: datetime64[ns]
<class 'pandas.core.series.Series'>

## Data Frame
- pandas.DataFrame
- 2d data type of data
- list
- tuple
- dict
- numpy array
    - string,float,complex-string/object

In [60]:
import pandas as p1
import numpy as np
df1=p1.DataFrame([[1,2,3],[4,5,"apssdc"]])

df3=p1.DataFrame({"k1":[11,12],"m1":[23,34]})
df4=p1.DataFrame(np.array([[1,3,5],[8,7,6]]))

In [56]:
df4

   0  1  2
0  1  3  5
1  8  7  6

In [57]:
print(type(df4))

<class 'pandas.core.frame.DataFrame'>

In [68]:

df2=p1.DataFrame(((1,3),(1,2),(3,4)),index=['x','y','z'])
df2

   0  1
x  1  3
y  1  2
z  3  4

In [71]:
df3.columns=["column1","column2"]
df3.index=["row1","row2"]
df3

      column1  column2
row1       11       23
row2       12       34

In [72]:
df3.columns

Index(['column1', 'column2'], dtype='object')

In [73]:
df3.index

Index(['row1', 'row2'], dtype='object')

In [75]:
import numpy as np
import pandas as pd
d1={"rollno":['19BTH' +str(i) for i in range(1,101)],
             'm1':np.random.randint(1,100,100),
             'm2':np.random.randint(1,100,100),
             'm3':np.random.randint(1,100,100)}
df=pd.DataFrame(d1)
df

      rollno  m1  m2  m3
0     19BTH1  49  53  12
1     19BTH2   3  40  87
2     19BTH3  99  78   4
3     19BTH4  66  85  36
4     19BTH5  71  55  25
..       ...  ..  ..  ..
95   19BTH96  88  81  60
96   19BTH97  50  44  28
97   19BTH98  39  70  38
98   19BTH99  29  10  36
99  19BTH100  33  82   9

[100 rows x 4 columns]

In [77]:
df.tail()

      rollno  m1  m2  m3
95   19BTH96  88  81  60
96   19BTH97  50  44  28
97   19BTH98  39  70  38
98   19BTH99  29  10  36
99  19BTH100  33  82   9

In [79]:
df.shape # rows,columns

(100, 4)

In [80]:
df.head(10)

    rollno  m1  m2  m3
0   19BTH1  49  53  12
1   19BTH2   3  40  87
2   19BTH3  99  78   4
3   19BTH4  66  85  36
4   19BTH5  71  55  25
5   19BTH6  46   2  31
6   19BTH7  41  97  34
7   19BTH8  82  35  97
8   19BTH9  11  88  30
9  19BTH10  90  13  77

## Acessing data From dataframe
- index
- slicing

In [81]:
df.head()

   rollno  m1  m2  m3
0  19BTH1  49  53  12
1  19BTH2   3  40  87
2  19BTH3  99  78   4
3  19BTH4  66  85  36
4  19BTH5  71  55  25

In [87]:
print(df['rollno'])
print(type(df['rollno']))

0       19BTH1
1       19BTH2
2       19BTH3
3       19BTH4
4       19BTH5
        ...
95     19BTH96
96     19BTH97
97     19BTH98
98     19BTH99
99    19BTH100
Name: rollno, Length: 100, dtype: object
<class 'pandas.core.series.Series'>

In [90]:
df[["rollno",'m2']]

      rollno  m2
0     19BTH1  53
1     19BTH2  40
2     19BTH3  78
3     19BTH4  85
4     19BTH5  55
..       ...  ..
95   19BTH96  81
96   19BTH97  44
97   19BTH98  70
98   19BTH99  10
99  19BTH100  82

[100 rows x 2 columns]

## iloc
- index location(0,1...)
## loc
- lable names

In [91]:
df.head()

   rollno  m1  m2  m3
0  19BTH1  49  53  12
1  19BTH2   3  40  87
2  19BTH3  99  78   4
3  19BTH4  66  85  36
4  19BTH5  71  55  25

In [92]:
df.iloc[0]

rollno    19BTH1
m1            49
m2            53
m3            12
Name: 0, dtype: object

In [93]:
df.iloc[0:10]

    rollno  m1  m2  m3
0   19BTH1  49  53  12
1   19BTH2   3  40  87
2   19BTH3  99  78   4
3   19BTH4  66  85  36
4   19BTH5  71  55  25
5   19BTH6  46   2  31
6   19BTH7  41  97  34
7   19BTH8  82  35  97
8   19BTH9  11  88  30
9  19BTH10  90  13  77

In [94]:
df.iloc[0:10][['rollno','m1']]

    rollno  m1
0   19BTH1  49
1   19BTH2   3
2   19BTH3  99
3   19BTH4  66
4   19BTH5  71
5   19BTH6  46
6   19BTH7  41
7   19BTH8  82
8   19BTH9  11
9  19BTH10  90

In [95]:
student_df=df.set_index("rollno")
student_df.head()

        m1  m2  m3
rollno
19BTH1  49  53  12
19BTH2   3  40  87
19BTH3  99  78   4
19BTH4  66  85  36
19BTH5  71  55  25

In [96]:
df.head()

   rollno  m1  m2  m3
0  19BTH1  49  53  12
1  19BTH2   3  40  87
2  19BTH3  99  78   4
3  19BTH4  66  85  36
4  19BTH5  71  55  25

In [97]:
student_df.loc['19BTH1']

m1    49
m2    53
m3    12
Name: 19BTH1, dtype: int32

In [98]:
student_df.loc['19BTH1']['m1']

49

In [103]:
student_df.loc['19BTH1':'19BTH10'][['m1','m2']]

         m1  m2
rollno
19BTH1   49  53
19BTH2    3  40
19BTH3   99  78
19BTH4   66  85
19BTH5   71  55
19BTH6   46   2
19BTH7   41  97
19BTH8   82  35
19BTH9   11  88
19BTH10  90  13

In [107]:
student_df["sum_columns"]=student_df.sum(axis='columns')
student_df["sum_m1"]=student_df['m1'].sum()
student_df.head()

        m1  m2  m3  sum_columns  sum_m1
rollno
19BTH1  49  53  12          456    5111
19BTH2   3  40  87          520    5111
19BTH3  99  78   4          724    5111
19BTH4  66  85  36          748    5111
19BTH5  71  55  25          604    5111